       data division.
       working-storage section.
        01 ws-layer-1 occurs 10 times.
            02 ws-layer-2 occurs 5 times.
               03 ws-layer-3 occurs 3 times.
                  77 ws-name pic a(5).
                  77 ws-age  pic 9(3).
                  77 ws-gender pic a.
        01 ws-other-stuff pic 9(4) value 0000.




    

